{"url": "https://docs.mulesoft.com/mule-runtime/latest/", "content": "Mule Runtime Engine Overview\nMule runtime engine (Mule) is a lightweight integration engine that runs Mule applications and supports domains and policies. Mule applications, domains, and policies share an XML DSL (domain-specific language).\nMule Applications\nMule applications connect systems, services, APIs, and devices using API-led connectivity instead of point-to-point integrations. Mule applications provide functionality for message routing, data mapping, orchestration, reliability, security, and scalability.\nAnypoint Studio supports Mule application development.\nMule Domains\nDomains enable you to share global configurations that Mule applications need to reuse, such as default error handlers, shared properties, scheduler pools, and component configurations. You can only deploy domains when running Mule runtime engine on premises.\nSee Shared Resources for information about developing and configuring Mule domains by using Anypoint Studio.\nSee Deploy a Domain for domain deployment instructions.\nPolicies\nPolicies on HTTP-based APIs can enforce security, regulate traffic through Mule applications, and adapt APIs to your business needs.\nMule includes an embedded API Gateway, which enables you to apply\nsecurity policies to an API, enrich incoming or outgoing messages, and add\ncapabilities to an API without having to write any code.\nSee API Gateway Capabilities\nfor additional information.\nAPI Manager supports the configuration of automated policies. Custom policy development and configuration are also supported.\nMaven Support\nMaven is a project management utility that Mule implements to enhance project development. Mule provides built-in Maven functionality. For the Mule runtime engine, you can integrate the packaging, testing, and deployment of your Mule applications, domains, and custom policies with your Maven lifecycle using the Mule Maven plugin.\nFor details, see Maven Support in Mule.\nMule Installation, Deployment, and Management\nFor a Mule app to run, it must be", "cached_at": "2025-10-29T21:08:38.594684"}