{"url": "https://docs.mulesoft.com/release-notes/cloudhub/cloudhub-runtimes-release-notes", "content": "December\nCloudHub Runtime and Operating System Patch Update Release Notes\nThese release notes describe monthly date-patch updates to Mule runtime engine and security updates to the underlying operating system for CloudHub.\nIn addition to these release notes, see:\nMuleSoft Commercial and Government Cloud Schedule\nThe following table shows the current schedule for monthly updates. These dates are subject to change.\n| Month | Release Available | Sandbox Environment Auto-Update | Production Environment Auto-Update |\n|---|---|---|---|\nDecember 2 |\nDecember 15-19 |\nDecember 20-21 |\n|\nNovember |\nNovember 4 |\nNovember 17-21 |\nNovember 22-23 |\nOctober |\nOctober 2* |\nOctober 20-24 |\nOctober 25-26 |\nSeptember |\nSeptember 2 |\nSeptember 15-19 |\nSeptember 20-21 |\n| The release notes for an update are published in the same week in which the runtime patch is released for all Mule versions on CloudHub. |\nAll releases occur in GMT-3 time. All automatic updates occur in the local time zone of the app’s deployment region. For example, CloudHub applies updates to apps deployed in the Asia-Pacific (Sydney) region in the AEST time zone and to apps deployed in the US West region in the PST time zone.\n| Using a runtime version that is more than three months old can introduce security vulnerabilities. If your application doesn’t update automatically within two monthly patching cycles, CloudHub stops the application and force-updates the application to the latest patch version. If an application doesn’t automatically start after the forced patch update, make sure the patch is applied and start the application. For more information, see Failed Automated Updates. |\n| * The release availability date for the October cycle has been preponed from October 7 to October 2. |\nOctober 2, 2025\nWhat’s New\n-\nMule runtime engine 4.10.0 is now available.\nFor information about the release notes, see Mule Runtime Engine 4.10.0 Release Notes. For information about the new release cadence, see Edge and LTS Relea", "cached_at": "2025-10-29T20:37:28.084844"}