{"url": "https://docs.mulesoft.com/release-notes/code-builder/acb-release-notes", "content": "Auto-approval for safe commands is now disabled in MuleSoft Dev Agent. Command execution now always requires explicit user approval, unless Execute all commands is enabled, preventing potential prompt injection exploits.\nAnypoint Code Builder Release Notes\nUse the Anypoint Code Builder integrated development environment (IDE) for your API designs, implementations, and integration development. Work locally with Anypoint Code Builder for Desktop on Microsoft Visual Studio Code (VS Code) or from your browser with Anypoint Code Builder on Anypoint Platform. The IDEs support the development lifecycle:\n-\nAPI specification design (OAS, RAML, and AsyncAPI), a mocking service for testing, source control, and publication to Anypoint Exchange\n-\nAPI implementation features for importing supported API specifications (OAS, RAML, GraphQL, and AsyncAPI) and autogenerating interfaces (scaffolding) for flows and error handlers within a Mule application\n-\nIntegration development to connect systems, transform data to required formats, and provide business logic to manage messages and events programmatically within a Mule application\nOctober 24, 2025\nAnypoint Code Builder releases new features in the Anypoint Extension Pack.\n-\nExtension pack version: 1.11.6\nTo use this extension pack in the desktop IDE, see Set up the Desktop IDE.\n-\nCloud IDE version: 1.11.5\nThis cloud IDE version runs the 1.11.6 extension pack.\nFor extension versions, see Change Log in the VS Code Marketplace.\nFor more information, see Known Issues and Compatibility.\nFixed Issues\n| Issue Resolution | ID |\n|---|---|\nW-19853225 |\n|\nEditing VS Code configuration files ( |\nW-19853255 |\nEditing the MCP configuration file ( |\nW-19853247 |\nOctober 14, 2025\nAnypoint Code Builder releases new features in the Anypoint Extension Pack.\n-\nExtension pack version: 1.11.5\nTo use this extension pack in the desktop IDE, see Set up the Desktop IDE.\nFor extension versions, see the Change Log in the VS Code Marketplace.\nFor more informatio", "cached_at": "2025-10-29T21:08:46.076818"}