{"url": "https://docs.mulesoft.com/release-notes/mule-runtime/lts-edge-release-cadence", "content": "Edge\nEdge and LTS Releases for Mule\nStarting with Mule 4.5, MuleSoft introduces two new release channels, Edge and Long-term Support (LTS). Both release channels are available in all our deployment models: Anypoint Runtime Fabric, CloudHub, CloudHub 2.0, and Hybrid Standalone. Consider the following factors to determine the approach that best suits your requirements ahead of the Mule 4.4 End of Standard Support.\n| Channel Type | Release Cadence | Differentiators | Support Coverage |\n|---|---|---|---|\nUp to three times per year |\n|\nFor versions 4.9 and later:\nFor version 4.8:\nFor versions 4.5 to 4.7:\n|\n|\nLTS |\nAnnual:\n|\n|\nFor version 4.6 and later:\n|\nIn February, both Edge and LTS release with the same underlying version, including a minor Mule runtime version and new features.\nTo review the new support policy that aligns with the new release periods and types of releases, see MuleSoft Support Policy.\n| The monthly patching process remains unchanged. See Update Patches to Mule. |\nEdge Channel\nStarting with Mule 4.5, MuleSoft releases Edge versions up to three times a year. Use the Edge channel if you want to stay on top of the latest features and feel comfortable with a more frequent release cycle and auto-app upgrade cycle. The Edge channel includes the latest features and innovations available on the MuleSoft platform.\nLTS Channel\nStarting with Mule 4.6, MuleSoft releases Long-Term Support (LTS) versions annually in February. If you are on Mule 4.4, you are not required to upgrade to Mule 4.6. However, because Mule 4.5 releases in October 2023, Standard Support for Mule 4.4 ends in October 2024, followed by the End of Extended Support in October 2025. For CloudHub and CloudHub 2.0 customers, once Standard Support for Mule 4.4 ends, if you want to deploy new apps, you must do so on Mule 4.6 LTS or Mule 4.8 Edge. Use the LTS channel if you want to avoid maintaining new versions frequently. The LTS channel adopts new capabilities after they have been introduced via Ed", "cached_at": "2025-10-29T20:37:22.727737"}