{"url": "https://docs.mulesoft.com/studio/to-download-and-install-studio-wx", "content": "Download and Install Anypoint Studio (Windows)\n-\nDownload the Anypoint Studio installation file from the Download Site.\n-\nExtract the Windows installation file into the\nC:\\root folder.To avoid installation errors:\n-\nEnsure that you extract the installation file into the\nC:\\folder so that the\nAnypointStudio.exefile is located in the\nC:\\AnypointStudio\\folder after installation.\n-\nEnsure that your user has read and write permissions for the\nC:\\directory.\n-\nIf you use a Windows antivirus application, ensure that the\nplugins/and\nfeatures/directories are in the trusted category.\n-\n-\nOpen the extracted Anypoint Studio.\nWhen Studio first runs, the embedded OpenJDK Platform libraries might cause a Windows Security alert.\nEnsure to allow the OpenJDK Platform library from Temurin publisher through your Windows firewall.\n-\nClick OK to accept the default workspace.\n-\nIf you choose to use an existing workspace, this must have been created using Anypoint Studio 7.0 or later.\nStudio 7.x supports only Mule 4.x projects, because the structure of the project, export format, XML, and scripting language are different from the ones used by Mule 3.x.\n-\nExclude Studio from Windows Defender Scans\nWhile Windows Defender is a tool for keeping your computer safe, it can slow down the performance of Studio because it scans files in real-time as they are accessed, which causes delays. To prevent performance issues, you can completely exclude Studio from Windows Defender real-time protection:\n-\nRun Studio.\nA Windows Defender real-time protection notice asks whether to exclude Studio folders and processes:\n-\nThe\n/.p2folder stores Studio plugins.\n-\nThe second folder shows the path of the workspace that you select when launching Studio.\n-\nThe third folder points to the Anypoint Studio application location.\n-\n-\nOptionally, select the Remember my decision checkbox.\n-\nClick Yes.\n-\nClick Yes again when Windows PowerShell requests permission to make the change:\n|If you select the Remember my decision che", "cached_at": "2025-10-29T21:15:27.492253"}